//%attributes = {"invisible":true,"preemptive":"capable"}
$端末種:=New collection:C1472
$端末種[3]:="精算機"
$端末種[4]:="携帯型端末"
$端末種[5]:="車載端末"
$端末種[7]:="券売機"
$端末種[8]:="券売機"
$端末種[9]:="入金機"
$端末種[18]:="券売機"
$端末種[20]:="券売機等"
$端末種[21]:="券売機等"
$端末種[22]:="改札機"
$端末種[23]:="簡易改札機"
$端末種[24]:="窓口端末"
$端末種[25]:="窓口端末"
$端末種[26]:="改札端末"
$端末種[27]:="携帯電話"
$端末種[28]:="乗継精算機"
$端末種[29]:="連絡改札機"
$端末種[31]:="簡易入金機"
$端末種[70]:="VIEW ALTTE"
$端末種[72]:="VIEW ALTTE"
$端末種[199]:="物販端末"
$端末種[200]:="自販機"

$処理:=New collection:C1472
$処理[1]:="運賃支払(改札出場)"
$処理[2]:="チャージ"
$処理[3]:="券購(磁気券購入)"
$処理[4]:="精算"
$処理[5]:="精算 (入場精算)"
$処理[6]:="窓出 (改札窓口処理)"
$処理[7]:="新規 (新規発行)"
$処理[8]:="控除 (窓口控除)"
$処理[13]:="バス (PiTaPa系)"
$処理[15]:="バス (IruCa系)"
$処理[17]:="再発 (再発行処理)"
$処理[19]:="支払 (新幹線利用)"
$処理[20]:="入A (入場時オートチャージ)"
$処理[21]:="出A (出場時オートチャージ)"
$処理[31]:="入金 (バスチャージ)"
$処理[35]:="券購 (バス路面電車企画券購入)"
$処理[70]:="物販"
$処理[72]:="特典 (特典チャージ)"
$処理[73]:="入金 (レジ入金)"
$処理[74]:="物販取消"
$処理[75]:="入物 (入場物販)"
$処理[198]:="物現 (現金併用物販)"
$処理[203]:="入物 (入場現金併用物販)"
$処理[132]:="精算 (他社精算"
$処理[133]:="精算 (他社入場精算)"

C_COLLECTION:C1488($1)

$values:=$1

$accumulator:=New collection:C1472

For each ($value;$values)
	$accumulator.push(parse_090f ($value;$端末種;$処理))
End for each 

$0:=$accumulator
